In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
arr1 = np.arange(9).reshape(3,3)

In [3]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [4]:
np.concatenate([arr1,arr1])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [5]:
np.concatenate([arr1,arr1], axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [6]:
ser1 =  Series([0,1,2],index=['T','U','V'])
ser2 = Series([3,4],index=['X','Y'])

In [7]:
ser1

T    0
U    1
V    2
dtype: int64

In [8]:
ser2

X    3
Y    4
dtype: int64

In [10]:
pd.concat([ser1,ser2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [12]:
pd.concat([ser1,ser2], axis=1, sort=False)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [14]:
pd.concat([ser1,ser2], axis=0, sort=False, keys=['cat1', 'cat2'])

cat1  T    0
      U    1
      V    2
cat2  X    3
      Y    4
dtype: int64

In [15]:
pd.concat([ser1,ser2], axis=1, sort=False, keys=['cat1', 'cat2'])

   cat1  cat2
T   0.0   NaN
U   1.0   NaN
V   2.0   NaN
X   NaN   3.0
Y   NaN   4.0

In [16]:
dframe1 = DataFrame(np.random.randn(4,3), columns=['X', 'Y', 'Z'])
dframe2 = DataFrame(np.random.randn(3, 3), columns=['Y', 'Q', 'X'])

In [17]:
dframe1

          X         Y         Z
0 -0.336422 -0.337983  1.106005
1  0.740739 -0.942379  0.432381
2 -2.462457  0.607016  0.762299
3 -1.123036 -1.679602  2.699788

In [18]:
dframe2

          Y         Q         X
0 -2.475915 -0.790348  1.294463
1 -1.031048  1.094501 -1.505083
2 -0.085307 -0.435205 -0.587901

In [20]:
pd.concat([dframe1, dframe2], sort=False)

          X         Y         Z         Q
0 -0.336422 -0.337983  1.106005       NaN
1  0.740739 -0.942379  0.432381       NaN
2 -2.462457  0.607016  0.762299       NaN
3 -1.123036 -1.679602  2.699788       NaN
0  1.294463 -2.475915       NaN -0.790348
1 -1.505083 -1.031048       NaN  1.094501
2 -0.587901 -0.085307       NaN -0.435205

In [21]:
pd.concat([dframe1,dframe2],ignore_index=True, sort=False)

          X         Y         Z         Q
0 -0.336422 -0.337983  1.106005       NaN
1  0.740739 -0.942379  0.432381       NaN
2 -2.462457  0.607016  0.762299       NaN
3 -1.123036 -1.679602  2.699788       NaN
4  1.294463 -2.475915       NaN -0.790348
5 -1.505083 -1.031048       NaN  1.094501
6 -0.587901 -0.085307       NaN -0.435205

In [23]:
pd.concat([ser1,ser2], axis=1, sort=False, join_axes=[['U', 'V', 'Y']])

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

     0    1
U  1.0  NaN
V  2.0  NaN
Y  NaN  4.0